Revit 2027 API
AnalysisDisplayLegendSettings.ScaleHeight Property
 Height of scale (for Diagram display). Measured in paperspace units.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ScaleHeight { get; set; }
Public Property ScaleHeight As Integer
	Get
	Set
public:
property int ScaleHeight {
	int get ();
	void set (int value);
}
member ScaleHeight : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentsInconsistentException |  When setting this property: scaleHeight is greater than 10000 or less than 0
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace